//Напишите программу, которая на вход принимает число и выдает его квадрат

Console.WriteLine("Введите число ");
int N = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(N*N);